OpenFOAM-13/tutorials/XiFluid/moriyoshiHomogeneous/moriyoshiHomogeneous/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            constantbXiIgnition;

    cellZone        ignition;

    start           0;
    duration        0.003;
    strength        2;

    XiCorr
    {
        type            cylindrical;
        cellZone        all;
        thickness       0.001;
        cylinderFraction 0.25;
    }
}


// ************************************************************************* //
